[
    {
        "Q": "What is this about?",
        "A": "This is about finding the seed of the mysterious \"pack.png\" image that Minecraft uses. All of this started with a YouTube video made by SalC1."
    },
    {
        "Q": "Are you just trying random seeds until you find it?",
        "A": "Not quite, we are going to use a supercomputer running a custom program that mathematically calculates the seeds and checks if they match based on what we know of the minecraft world generation."
    },
    {
        "Q": "Can we use the method they did with PewDiePie's seed?",
        "A": "Nope! They had more information than we did, and we actually have the people who worked on the PewDiePie seed in the Discord server right now!"
    },
    {
        "Q": "Have you tried seed X?",
        "A": "You can go <a href=\"https://packpng.com/\">here</a> to see a incomplete list of seeds we have tried. People have tried way more than these, but these are the important ones. Sadly, trying seeds isn't really helpful."
    },
    {
        "Q": "How can I help crack the seed",
        "A": "You need 1 of the following:<br>1. Enterprise grade computing hardware. No, a good gaming GPU isn't enough.<br>2. The ability to help in reverse engineering the world generator code."
    },
    {
        "Q": "What is pack.png?",
        "A": "The image Minecraft used for the default texture pack in the texture pack selection screen, and also for greyed out if a server doesn't have a icon."
    },
    {
        "Q": "What information could you extract from the image?",
        "A": "We know that the player is looking towards -z/+x from the water animation direction. We also know based off the cloud pattern that if the image was taken within 10 minutes of spawning, the mountain cant be further than 3074 block from the spawn location."
    },
    {
        "Q": "Who made this website?",
        "A": "Head over to the <a href=\"https://packpng.com/about\">about</a> page to see the contributors to this page!"
    },
    {
        "Q": "Do you have enough processing power? I could rent out stuff from X",
        "A": "Yes, we have plenty of processing power. To be exact, 2-6 NVIDIA DGX-2 Supercomputers."
    },
    {
        "Q": "How many seeds are there?",
        "A": "2^48*0.82 seeds.<br>230,809,480,902,738<br>230.8 Trillion "
    },
    {
        "Q": "Can I help with this?",
        "A": "Yes! We'd love your help! The Discord is at the very bottom. Please make sure to read all of the FAQ and read the rules channel when you join."
    }
]
